UString.translit=function(s){
	[
		[/æ|ǽ/,'ae'],
		[/œ/,'oe'], [/Œ/,'OE'],
		[/Ä|À|Á|Â|Ã|Ä|Å|Ǻ|Ā|Ă|Ą|Ǎ/,'A'], [/ä|à|á|â|ã|å|ǻ|ā|ă|ą|ǎ|ª/,'a'],
		[/Ç|Ć|Ĉ|Ċ|Č/,'C'], [/ç|ć|ĉ|ċ|č/,'c'],
		[/Ð|Ď|Đ/,'D'], [/ð|ď|đ/,'d'],
		[/È|É|Ê|Ë|Ē|Ĕ|Ė|Ę|Ě|€/,'E'], [/è|é|ê|ë|ē|ĕ|ė|ę|ě/,'e'],
		[/Ĝ|Ğ|Ġ|Ģ/,'G'], [/ĝ|ğ|ġ|ģ/,'g'],
		[/Ĥ|Ħ/,'H'], [/ĥ|ħ/,'h'],
		[/Ì|Í|Î|Ï|Ĩ|Ī|Ĭ|Ǐ|Į|İ/,'I'], [/ì|í|î|ï|ĩ|ī|ĭ|ǐ|į|ı/,'i'],
		[/Ĵ/,'J'], [/ĵ/,'j'],
		[/Ķ/,'K'], [/ķ/,'k'],
		[/Ĺ|Ļ|Ľ|Ŀ|Ł/,'L'], [/ĺ|ļ|ľ|ŀ|ł/,'l'],
		[/Ñ|Ń|Ņ|Ň/,'N'], [/ñ|ń|ņ|ň|ŉ/,'n'],
		[/Ö|Ò|Ó|Ô|Õ|Ō|Ŏ|Ǒ|Ő|Ơ|Ø|Ǿ/,'O'], [/ö|ò|ó|ô|õ|ō|ŏ|ǒ|ő|ơ|ø|ǿ|º|°/,'o'],
		[/Ŕ|Ŗ|Ř/,'R'], [/ŕ|ŗ|ř/,'r'],
		[/Ś|Ŝ|Ş|Š/,'S'], [/ś|ŝ|ş|š|ſ/,'s'],
		[/Ţ|Ť|Ŧ/,'T'], [/ţ|ť|ŧ/,'t'],
		[/Ü|Ù|Ú|Û|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ư|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ/,'U'], [/ü|ù|ú|û|ũ|ū|ŭ|ů|ű|ų|ư|ǔ|ǖ|ǘ|ǚ|ǜ/,'u'],
		[/Ý|Ÿ|Ŷ/,'Y'], [/ý|ÿ|ŷ/,'y'],
		[/Ŵ/,'W'], [/ŵ/,'w'],
		[/Ź|Ż|Ž/,'Z'], [/ź|ż|ž/,'z'],
		[/Æ|Ǽ/,'AE'],
		[/ß/,'ss'],
		[/Ĳ/,'IJ'], [/ĳ/,'ij'],
		
		[/ƒ/,'f'],
		[/&/,'et'],
		
		[/þ/,'th'],
		[/Þ/,'TH'],
	].forEach(function(v){ s=s.replace(v[0],v[1]); });
	return s;
};

UString.normalize=function(s){
	return UString.translit(s).replace(/[ \-\'\"\_\(\)\[\]\{\}\#\~\&\*\,\.\;\:\!\?\/\\\\|\`\<\>\+]+/,' ').trim().toLowerCase();
};
UString.slugify=function(s,replacement){
	if(replacement===undefined) replacement='-';
	return UString.translit(s.trim())
		.replace(/([^\d\.])\.+([^\d\.]|$)/g,'$1 $2')
		.replace(/[^\w\d\.]/g,' ')
		.trim()
		.replace(/\s+/g,replacement)
		.replace(new RegExp('^'+S.regexpEscape(replacement)+'+|'+S.regexpEscape(replacement)+'+$'),'');
};